Config/Catalogs/Студенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Студенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОСубсидии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОтправителемТрансферта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставленныйКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученныйКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставленнаяГарантия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИноеОбязательство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионеромНаЗакупку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ПорядокВыпискиСФЗаУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПорядокВыпискиСФЗаУслуги</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сводно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПлательщика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/РегистрацияПлательщиковПоДоговоруОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РегистрацияПлательщиковПоДоговоруОбразование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлательщикиПоДоговоруОбразование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Плательщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокВыпискиСФ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядокВыпискиСФЗаУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/ВидыПриказовОбразование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыПриказовОбразование</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СостояниеСтудента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияСтудентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеДополнительнойУслугой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПоляПриказовОбразование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заполнять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаполнениеОбязательно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказыватьПредыдущееЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ПоляПриказовОбразование</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/Студенты/Forms/ПомощникВводаДоговора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Студент = Параметры.Студент;
	Организация = Параметры.Организация;
	КонтрагентСтудента = Параметры.КонтрагентСтудента;
	
	СозданиеНовогоДоговора = Истина;
	
	Контрагент = КонтрагентСтудента;
	
	ИспользоватьКонтрольИсполненияДоговоров = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаВестиГрафикиИсполнения", "Видимость",
			ИспользоватьКонтрольИсполненияДоговоров);
	
	Если ТипЗнч(Параметры.ДополнительныеЗначенияЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ДополнительныеЗначенияЗаполнения);
	КонецЕсли;
	
	ВидПоСтандарту = 0; // По умолчанию - долгосрочный договор.
	ИспользоватьКонтрольИсполненияДоговоров = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров");
	
	ВвестиПриказОЗачислении = Истина;	
	ДатаПриказа = ТекущаяДата();
	ВидНачисления = 0; // По умолчанию - образовательные услуги.
	
	ПолучитьВидыПриказовНаСервере();
	
	УказатьПлательщиков = Ложь;	
	ДатаРегистрацииПлательщиков = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьСоответствиеКотрагентаСтудента();
	УстановитьВидимостьДанныхДоговора();
	УстановитьВидимостьНачислениеЗаУслугу();
	ОбновитьАвтоНаименование();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если УказатьПлательщиков Тогда
		ОшибкиТаблицыПлательщиков = Ложь;
		Для Каждого СтрокаПлательщика Из Плательщики Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаПлательщика.Контрагент) ИЛИ 
				НЕ ЗначениеЗаполнено(СтрокаПлательщика.ПорядокВыпискиСФ) ИЛИ 
				НЕ ЗначениеЗаполнено(СтрокаПлательщика.ДоляОплаты) Тогда
				
				ОшибкиТаблицыПлательщиков = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ОшибкиТаблицыПлательщиков Тогда		   
			Отказ = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				   НСтр("ru = 'Для записи необходимо заполнить все поля Контрагент, Доля оплаты и Порядок выписки СФ .'"), ,
				   "Плательщики");
		КонецЕсли;
		
	Иначе
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Плательщики"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаРегистрацииПлательщиков"));
	КонецЕсли;
	
	Если НЕ ВвестиПриказОЗачислении Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВидПриказа"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Факультет"));
	КонецЕсли;
	
	Если СозданиеНовогоДоговора Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДоговорСсылка"));
	Иначе
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Наименование"));
	КонецЕсли;
        
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СозданиеНовогоДоговораПриИзменении(Элемент)
	
	Если СозданиеНовогоДоговора Тогда
		Контрагент = КонтрагентСтудента;
	Иначе
		Контрагент = Неопределено;
	КонецЕсли;
	
	УстановитьВидимостьДанныхДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ПроверитьСоответствиеКотрагентаСтудента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорСсылкаПриИзменении(Элемент)
	
	ЗаполнитьКонтрагентПоДоговору(ДоговорСсылка);
	ПроверитьСоответствиеКотрагентаСтудента();
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьПлательщиковПриИзменении(Элемент)
	
	УстановитьВидимостьПлательщиков();
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПриказОЗачисленииПриИзменении(Элемент)
	
	УстановитьВидимостьПриказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбязательстваПриИзменении(Элемент)
	
	ОбновитьАвтоНаименование();
	ОбновитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбязательстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбязательстваОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбновитьАвтоНаименование();
	ОбновитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДоговораПриИзменении(Элемент)
	
	ОбновитьАвтоНаименование();
	ОбновитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	
	ОбновитьАвтоНаименование();
	ОбновитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПриказаПриИзменении(Элемент)
	
	Если ВидНачисления = 1 Тогда
		НачислениеСтудентамЗаПрочиеУслуги = ДопУслугаПоВидуПриказа(ВидПриказа);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВидПриказаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = ДопустимыеВидыПриказов;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНачисленияПриИзменении(Элемент)
	
	ВидПриказа = Неопределено;
	
	Если ВидНачисления = 1 Тогда
		УказатьПлательщиков = Ложь;
		
		Элементы.ГруппаПараметрыРегистрацииПлательщиков.Видимость = Ложь;
		Элементы.ГруппаПлательщики.Видимость = Ложь;
	Иначе
		Элементы.ГруппаПараметрыРегистрацииПлательщиков.Видимость = Истина;
		УстановитьВидимостьПлательщиков();
	КонецЕсли;
	УстановитьВидимостьНачислениеЗаУслугу();
	
	ПолучитьВидыПриказовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПоСтандартуПриИзменении(Элемент)
	
	Если ВидНачисления = 0 Тогда
		ВидПриказа = Неопределено;
	КонецЕсли;	
		
	ПолучитьВидыПриказовНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыПлательщики

&НаКлиенте
Процедура ПлательщикиСуммаОплатыПриИзменении(Элемент)
	
	ПересчитатьДолиОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикиДоляОплатыПриИзменении(Элемент)
	
	ПересчитатьСуммыОплаты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Перем ТекстСообщения;
	
	Отказ = Ложь;
	ОчиститьСообщения();
	
	Отказ = НЕ ПроверитьЗаполнение();
	
	Если НЕ Отказ Тогда
		ЗаписатьДанныеНаСервере(Отказ, ТекстСообщения);
	КонецЕсли;	
	
	Если НЕ Отказ Тогда 
		Оповестить("ОбновитьДанныеСтудента");
		
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("ДоговорСсылка", ДоговорСсылка);
		
		//Параметры для приказа.
		ПараметрыЗакрытия.Вставить("ВвестиПриказОЗачислении", ВвестиПриказОЗачислении);
		ПараметрыЗакрытия.Вставить("ДатаПриказа", ДатаПриказа);
		ПараметрыЗакрытия.Вставить("ВидПриказа", ВидПриказа);
		ПараметрыЗакрытия.Вставить("Факультет", Факультет);
		ПараметрыЗакрытия.Вставить("НачислениеСтудентамЗаПрочиеУслуги", НачислениеСтудентамЗаПрочиеУслуги);
		
		Закрыть(ПараметрыЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьСоответствиеКотрагентаСтудента()
	
	ИспользуетсяКонтрагентСтудента = КонтрагентСтудента = Контрагент;
	Если НЕ ИспользуетсяКонтрагентСтудента Тогда
		УказатьПлательщиков = Истина;
	КонецЕсли;
	Элементы.УказатьПлательщиков.Доступность = ИспользуетсяКонтрагентСтудента;
	
	УстановитьВидимостьПлательщиков();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПлательщиков()
	
	Элементы.ГруппаПлательщики.Видимость = УказатьПлательщиков;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПриказа()
	
	Элементы.ГруппаПриказ.Видимость = ВвестиПриказОЗачислении;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДанныхДоговора()
	
	Элементы.ГруппаНовыйДоговор.Видимость = СозданиеНовогоДоговора;
	Элементы.ГруппаСуществующийДоговор.Видимость = НЕ СозданиеНовогоДоговора;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНачислениеЗаУслугу()
	
	Элементы.НачислениеСтудентамЗаПрочиеУслуги.Видимость = ВидНачисления = 1;
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьАвтоНаименование()
	
	АвтоНаименование = " от " + Формат(ДатаДоговора, "ДФ=dd.MM.yyyy; ДП=-") + " № " + СокрЛП(НомерДоговора);
	АвтоНаименование = СокрЛ(Лев(СокрЛП(ВидОбязательства), 59 - СтрДлина(АвтоНаименование))
	                   + АвтоНаименование);
					   
	Возврат АвтоНаименование;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьАвтоНаименование()
	
	АвтоНаименование = ПолучитьАвтоНаименование();
					   
	Элементы.Наименование.СписокВыбора.Очистить();
	Элементы.Наименование.СписокВыбора.Добавить(АвтоНаименование);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименование()
	
	Если Элементы.Наименование.СписокВыбора.Количество() > 0 Тогда
		Наименование = Элементы.Наименование.СписокВыбора[0];
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере(Отказ, ТекстСообщения = "")
	
	Отказ = Ложь;
	
	НачатьТранзакцию();
	
	Если СозданиеНовогоДоговора Тогда
		СоздатьДоговорНаСервере(Отказ);
	КонецЕсли;	
	
	Если УказатьПлательщиков Тогда
		СоздатьРегистрациюПлательшиковНаСервере(Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДоговорНаСервере(Отказ)
	
	ДоговорОбъект = Справочники.Договоры.СоздатьЭлемент();
	
	РеквизитыЗаполнения = Новый Массив;
	РеквизитыЗаполнения.Добавить("Организация");
	РеквизитыЗаполнения.Добавить("КонтрольЗаполненияРабочегоНаименования");
	РеквизитыЗаполнения.Добавить("Родитель");
	РеквизитыЗаполнения.Добавить("Наименование");
	РеквизитыЗаполнения.Добавить("СчетКонтрагента");
	РеквизитыЗаполнения.Добавить("Контрагент");
	РеквизитыЗаполнения.Добавить("НомерДоговора");
	РеквизитыЗаполнения.Добавить("ДатаДоговора");
	РеквизитыЗаполнения.Добавить("ВидОбязательства");
	
	ЗаполнитьЗначенияСвойств(ДоговорОбъект, ЭтаФорма, СтрСоединить(РеквизитыЗаполнения, ","));
	
	Если ВидПоСтандарту = 0 Тогда // Долгосрочный договор.
		Если ИспользоватьКонтрольИсполненияДоговоров Тогда
			// По долгосрочным договорам студентов графики ведутся автоматически, не нужно вводить дополнительных данных,
			// поэтому по умолчанию в договоре со студентом установим ведение графиков.
			ДоговорОбъект.ВестиПланГрафикИсполнения = Истина;
			ДоговорОбъект.ВестиГрафикПлатежей = Истина;
		КонецЕсли;
	Иначе
		ДоговорОбъект.ВестиПланГрафикИсполнения = Ложь;
		ДоговорОбъект.ВестиГрафикПлатежей = Ложь;
	КонецЕсли;
	
	ДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
		
	ДоговорОбъект.Записать();
	
	ДоговорСсылка = ДоговорОбъект.Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРегистрациюПлательшиковНаСервере(Отказ)
	
	РегистрацияОбъект = Документы.РегистрацияПлательщиковПоДоговоруОбразование.СоздатьДокумент();

	РегистрацияОбъект.Дата = ДатаРегистрацииПлательщиков;
	РегистрацияОбъект.Организация = Организация;
	РегистрацияОбъект.Студент = Студент;
	РегистрацияОбъект.Договор = ДоговорСсылка;
	
	Для Каждого СтрокаПлательщики Из Плательщики Цикл
		НоваяСтрока = РегистрацияОбъект.Плательщики.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПлательщики);
	КонецЦикла;
	
	ЗаписатьДокумент(РегистрацияОбъект, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДокумент(ЗаписываемыйДокумент, Отказ)
	
	Попытка
		ЗаписываемыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Исключение
		ОписаниеОшибки = ИнформацияОбОшибке();
		
		ОтменитьТранзакцию();
		
		МетаданныеОбъекта = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(
			ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ЗаписываемыйДокумент)));
		
		ЗаписьЖурналаРегистрации("Помощник регистрации плательщиков (образование).Запись",
								УровеньЖурналаРегистрации.Ошибка,
								МетаданныеОбъекта,
								,
								ПодробноеПредставлениеОшибки(ОписаниеОшибки));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ОписаниеОшибки));
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикиКонтрагентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Плательщики.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ПорядокВыпискиСФ) Тогда
			ТекущиеДанные.ПорядокВыпискиСФ = ПредопределенноеЗначение("Перечисление.ПорядокВыпискиСФЗаУслуги.Сводно");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ДоляОплаты) Тогда
			ТекущиеДанные.ДоляОплаты = 100;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидыПриказовНаСервере()
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыПриказовОбразование.Ссылка КАК Ссылка

		|ИЗ
		|	Справочник.ВидыПриказовОбразование КАК ВидыПриказовОбразование
		|ГДЕ
		|	%ТекстУсловияВидНачисления%
		|	И %ТекстУсловияТипДоговора%";

	Если ВидНачисления = 0 Тогда
		// Заключение договора по основной образовательной деятельности.
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ТекстУсловияВидНачисления%", "ВидыПриказовОбразование.СостояниеСтудента.ДействуетНачисление = ИСТИНА");
		
		Если ВидПоСтандарту = 0 Тогда
			// Долгосрочный договор.
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ТекстУсловияТипДоговора%", "ВидыПриказовОбразование.Поля.Поле = Значение(ПланВидовХарактеристик.ПоляприказовОбразование.ГрафикОплаты)");
		Иначе
			// Краткосрочный договор.
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ТекстУсловияТипДоговора%", "НЕ ВидыПриказовОбразование.Поля.Поле = Значение(ПланВидовХарактеристик.ПоляприказовОбразование.ГрафикОплаты)");
		КонецЕсли;
		
	Иначе
		// Заключение договора по дополнительным услугам.
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ТекстУсловияВидНачисления%", "ВидыПриказовОбразование.УправлениеДополнительнойУслугой = 1");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ТекстУсловияТипДоговора%", "ИСТИНА");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ВидыПриказовОтбор = РезультатЗапроса.ВыгрузитьКолонку("Ссылка");
	
	ДопустимыеВидыПриказов.ЗагрузитьЗначения(ВидыПриказовОтбор);	
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьДолиОплаты()
	
	Если Плательщики.Итог("СуммаОплаты") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивКоэффициентов = Новый Массив;
	Для Каждого СтрокаТаблицы Из Плательщики Цикл
		МассивКоэффициентов.Добавить(СтрокаТаблицы.СуммаОплаты);
	КонецЦикла;
	
	МассивДолиОплаты = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
		100, МассивКоэффициентов, 4); // Распределим 100% пропорционально введенным суммам оплаты.
	Для Инд = 0 По МассивКоэффициентов.Количество() - 1 Цикл
		СтрокаТаблицы = Плательщики[Инд];
		СтрокаТаблицы.ДоляОплаты = ?(МассивДолиОплаты = Неопределено, 0, МассивДолиОплаты[Инд]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыОплаты()
	
	МассивКоэффициентов = Новый Массив;
	Для Каждого СтрокаТаблицы Из Плательщики Цикл
		МассивКоэффициентов.Добавить(СтрокаТаблицы.ДоляОплаты);
	КонецЦикла;
	
	МассивСуммОплаты = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
		Плательщики.Итог("СуммаОплаты"), МассивКоэффициентов); // Распределим общую сумму оплаты пропорционально введенным долям оплаты.
	Для Инд = 0 По МассивКоэффициентов.Количество() - 1 Цикл
		СтрокаТаблицы = Плательщики[Инд];
		СтрокаТаблицы.СуммаОплаты = ?(МассивСуммОплаты = Неопределено, 0, МассивСуммОплаты[Инд]);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтрагентПоДоговору(ДоговорСсылка)
	
	Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорСсылка, "Контрагент");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДопУслугаПоВидуПриказа(ВидПриказа)
	Возврат РаботаСоСтудентамиПовтИсп.ДопУслугаПоВидуПриказа(ВидПриказа);
КонецФункции

#КонецОбласти
